# SQL Basics

## 1. SQL Data Types

#### Numeric Types:
* INTEGER: Used for whole numbers.
* SMALLINT: Small integer values.
* BIGINT: Large integer values.
* NUMERIC(precision, scale): Exact numeric value with specified precision and scale.
* DECIMAL(precision, scale): Exact numeric value similar to NUMERIC.

#### Character and String Types:
* CHAR(n): Fixed-length character string.
* VARCHAR(n): Variable-length character string with a maximum length of 'n'.
* TEXT: Variable-length character string for large text data.

#### Date and Time Types:
* DATE: Date values in the format 'YYYY-MM-DD'.
* TIME: Time values in the format 'HH:MM:SS'.
* TIMESTAMP: Date and time values in the format 'YYYY-MM-DD HH:MM:SS'.
* INTERVAL: Time intervals.

#### Boolean Type:
* BOOLEAN: Represents true or false values.

#### Other Types:
* BLOB: Binary Large Object for storing binary data.
* JSON: JSON data.

## 2. Creating Tables
The CREATE TABLE statement is fundamental in SQL. It allows you to design the structure of your database tables, defining columns, their data types, and various constraints.

Example:

In [ ]:
CREATE TABLE Students (
    StudentID INTEGER PRIMARY KEY,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    BirthDate DATE,
    IsEnrolled BOOLEAN DEFAULT true
);

In this example, StudentID is the primary key, and IsEnrolled is a boolean column with a default value of true.

## 3. Updating Tables:
To modify existing tables, you use the ALTER TABLE statement. For instance, adding a new column to an existing table:

In [ ]:
ALTER TABLE Students
    ADD COLUMN GPA FLOAT;

## 4. Dropping Tables:
The DROP TABLE statement removes an entire table along with its data:

In [ ]:
DROP TABLE Students;

## 5. Column Options:

Primary Key: Uniquely identifies each student in the table.

In [ ]:
CREATE TABLE Students (
    StudentID INTEGER PRIMARY KEY,
    ...
);

NOT NULL: Ensures that certain columns must have a value, disallowing NULLs.

In [ ]:
CREATE TABLE Students (
    StudentID INTEGER NOT NULL,
    ...
);

UNIQUE: Ensures all values in a column are unique.

In [ ]:
CREATE TABLE Students (
    StudentID INTEGER UNIQUE,
    ...
);

DEFAULT: Provides a default value for a column.

In [ ]:
CREATE TABLE Students (
    ...
    IsEnrolled BOOLEAN DEFAULT true,
    ...
);

FOREIGN KEY: Establishes a link between tables, for example, linking students to their courses.

In [ ]:
CREATE TABLE Enrollments (
    EnrollmentID INTEGER PRIMARY KEY,
    StudentID INTEGER,
    CourseID INTEGER,
    FOREIGN KEY (StudentID) REFERENCES Students(StudentID),
    FOREIGN KEY (CourseID) REFERENCES Courses(CourseID)
);

## 6. CRUD Operations in SQL

CRUD stands for Create, Read, Update, and Delete. These operations are fundamental in database management and are used to manipulate data in a database.

### Create (INSERT)

The **Create** operation involves adding new data into a database.

In [ ]:
#Syntax
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);

##Example:
INSERT INTO users (name, age) VALUES ('Alice', 30);

### Read (SELECT)
The Read operation retrieves data from a database.

In [ ]:
#Syntax
SELECT column1, column2, ...
FROM table_name
WHERE condition;

#Example:
SELECT * FROM users WHERE name = 'Alice';

### Update (UPDATE)
The Update operation modifies existing data in a database.

In [ ]:
#Syntax
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;

#Example:
UPDATE users SET age = 31 WHERE name = 'Alice';

### Delete (DELETE)
The Delete operation removes data from a database.

In [ ]:
#Syntax
DELETE FROM table_name WHERE condition;

#Example:
DELETE FROM users WHERE name = 'Alice';

## 7. Table Relationships

### 1. One-to-One Relationship:

In a one-to-one relationship, each record in the first table is associated with only one record in the second table, and vice versa.

One-to-one relationships are used to connect two entities where each instance in the relationship corresponds to exactly one instance in the related table. This type of relationship is uncommon in most database designs and is typically used when specific attributes of an entity need to be separated into a distinct table.

**Example:**

Tables:

Staff
* StaffID (Primary Key)
* Name
* Position

IDCard
* IDCardID (Primary Key)
* StaffID (Foreign Key referencing Staff table)
* CardNumber

In this scenario, each staff member in the "Staff" table has a unique ID represented by "StaffID". Their corresponding ID card information, such as "CardNumber", is stored in the "IDCard" table. The "StaffID" in the "IDCard" table establishes the one-to-one relationship, ensuring that each staff member has only one ID card.

### 2. One-to-Many Relationship:

In a one-to-many relationship, each record in the first table can have multiple related records in the second table, but each record in the second table corresponds to only one record in the first table.

One-to-many relationships are the most common type of relationship in relational databases. In this relationship, one entity (the "one" side) can be associated with multiple instances of another entity (the "many" side), but each instance of the latter can be linked to only one instance of the former.

**Example:**

Tables:

Departments
* DepartmentID (Primary Key)
* DepartmentName

Professors
* ProfessorID (Primary Key)
* Name
* DepartmentID (Foreign Key referencing Departments table)
* Subject

In this example, the "Departments" table stores information about different college departments, with each department having a unique "DepartmentID". The "Professors" table contains details about professors. The "DepartmentID" in the "Professors" table establishes the one-to-many relationship, indicating that each department can have multiple professors, but each professor belongs to only one department.

### 3. Many-to-Many Relationship:

In a many-to-many relationship, each record in both tables can have multiple related records in the other table.

Many-to-many relationships are used to model complex interactions where multiple instances of one entity are related to multiple instances of another entity. To represent this relationship in a relational database, a junction table (also called an associative or link table) is introduced.

**Example:**

Tables:

Students
* StudentID (Primary Key)
* Name

Courses
* CourseID (Primary Key)
* CourseName

StudentCourses (Junction Table)
* StudentCoursesID (Primary Key)
* StudentID (Foreign Key referencing Students table)
* CourseID (Foreign Key referencing Courses table)

In this example, the "Students" table stores student information, the "Courses" table stores course details, and the "StudentCourses" table acts as a junction table. The "StudentID" and "CourseID" columns in the "StudentCourses" table establish many-to-many relationships. This setup allows multiple students to be enrolled in multiple courses, creating a comprehensive representation of the relationships between students and courses.